GuoZhiyong/RTT_GPS_STUSB_TEST/bsp/stm32f40x_production/drivers/mc8332.c
	USART_ITConfig( UART4, USART_IT_RXNE, ENABLE );

	return RT_EOK;
}

/***********************************************************
* Function:	提供给其他thread调用，打开设备，超时判断
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gsm_open( rt_device_t dev, rt_uint16_t oflag )
{
	if( gsm_state == GSM_IDLE )
	{
		gsm_state = GSM_POWERON; //置位上电过程中
	}
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gsm_close( rt_device_t dev )
{
	gsm_state = GSM_POWEROFF; //置位断电过程中
	return RT_EOK;
}

/***********************************************************
* Function:m66_read
* Description:数据模式下读取数据
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_size_t dev_gsm_read( rt_device_t dev, rt_off_t pos, void* buff, rt_size_t count )
{
	return RT_EOK;
}

/* write one character to serial, must not trigger interrupt */
static void uart4_putc( const char c )
{
	USART_SendData( UART4, c );
	while( !( UART4->SR & USART_FLAG_TC ) )
	{
		;
	}
	UART4->DR = ( c & 0x1FF );
}

/***********************************************************
* Function:		dev_gsm_write
* Description:	数据模式下发送数据，要对数据进行封装
* Input:		const void* buff	要发送的原始数据
       rt_size_t count	要发送数据的长度
       rt_off_t pos		使用的socket编号
* Output:
* Return:
* Others:
***********************************************************/

static rt_size_t dev_gsm_write( rt_device_t dev, rt_off_t pos, const void* buff, rt_size_t count )
{
	rt_size_t	len = count;
	uint8_t		*p	= (uint8_t*)buff;

	while( len )
	{
		USART_SendData( UART4, *p++ );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		len--;
	}
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static rt_err_t dev_gsm_control( rt_device_t dev, rt_uint8_t cmd, void *arg )
{
	switch( cmd )
	{
		case CTL_STATUS:
			*( (int*)arg ) = gsm_state;
			break;
		case CTL_AT_CMD: //发送at命令,结果要返回
			break;
		case CTL_PPP:
			break;
		case CTL_SOCKET:
			break;
	}
	return RT_EOK;
}

/***********************************************************
* Function:		gsmrx_cb
* Description:	gsm收到信息的处理
* Input:			char *s     信息
    uint16_t len 长度
* Output:
* Return:
* Others:
***********************************************************/
static void gsmrx_cb( uint8_t *pInfo, uint16_t len )
{
	static LCD_MSG	lcd_msg;
	int				i, count, newlen;
	uint8_t			tbl[24] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 0, 0, 0, 0, 0, 0, 0, 0xa, 0xb, 0xc, 0xd, 0xe, 0xf };
	char			c, *pmsg;
	uint8_t			*psrc, *pdst;
	int32_t			infolen, link;

/*网络侧的信息，直接通知上层软件*/
	if( fgsm_rawdata_out )
	{
		rt_kprintf( "\r\n%08d gsm_rx>%s\r\n", rt_tick_get( ), pInfo );
		fgsm_rawdata_out--;
	}


/*
   会返回诸如<0d><0a>OK<0d><0a>之类的数据
   去掉前面不必要的0d0a 和空格等不可见字符
 */
	count = 0;
	while( ( *( pInfo + count ) < 0x21 ) && ( count < len ) )
	{
		count++;
	}
	psrc	= pInfo + count;
	newlen	= len - count;

	if( strncmp( psrc, "%IPDATA:", 7 ) == 0 )
	{
		/*解析出净信息,编译器会优化掉pdst*/
		i = sscanf( psrc, "%%IPDATA:%d,%d,%s", &link, &infolen, pdst );
		if( i != 3 )
		{
			return;
		}
		if( infolen < 11 )
		{
			return;
		}
		if( *pdst != '"' )
		{
			return;
		}
		psrc	= pdst;
		pmsg	= pdst + 1; /*指向下一个位置*/
		for( i = 0; i < infolen; i++ )
		{
			c		= tbl[*pmsg++ - '0'] << 4;
			c		|= tbl[*pmsg++ - '0'];
			*pdst++ = c;
		}
		//gprs_rx( link, psrc, infolen );
		return;
	}
/*有呼叫进来*/
	if( strncmp( psrc, "RING", 4 ) == 0 )
	{
		lcd_msg.id				= LCD_MSG_ID_GSM;
		lcd_msg.info.payload[0] = 1;    /*接通*/
		pscr->msg( (void*)&lcd_msg );
	}

	if( strncmp( psrc, "NOCARRIER", 9 ) == 0 )
	{
		lcd_msg.id				= LCD_MSG_ID_GSM;
		lcd_msg.info.payload[0] = 2;    /*挂断*/
		pscr->msg( (void*)&lcd_msg );
	}

	if( strncmp( psrc, "%TTS: 0", 7 ) == 0 )
	{
		tts_playing = 0;
	}
	/*直接发送到Mailbox中*/
	pmsg = rt_malloc( len );
	if( pmsg != RT_NULL )
	{
		*pmsg			= len >> 8;
		*( pmsg + 1 )	= len & 0xff;
		memcpy( pmsg + 2, pInfo, len );
		rt_mb_send( &mb_gsmrx, (rt_uint32_t)pmsg );
	}
	return;
}

/**/
rt_err_t pt_resp_ZPPPSTATUS( char *p, uint16_t len )
{
	char *pfind = RT_NULL;
	pfind = strstr( p, "OPENED" );
	if( pfind )
	{
		return RT_EOK; /*找到了*/
	}
	return RT_ERROR;
}

/**/
rt_err_t pt_resp_ZIND( char *p, uint16_t len )
{
	char *pfind = RT_NULL;
	pfind = strstr( p, "ZIND" );
	if( pfind )
	{
		return RT_EOK; /*找到了*/
	}
	return RT_ERROR;
}

/*  */
rt_err_t pt_resp_STR_OK( char *p, uint16_t len )
{
	char *pfind = RT_NULL;
	pfind = strstr( p, "OK" );
	if( pfind )
	{
		return RT_EOK; /*找到了*/
	}
	return RT_ERROR;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t pt_resp_TTS_OK( char *p, uint16_t len )
{
	char *pfind = RT_NULL;
	pfind = strstr( p, "%TTS: 0" );
	if( pfind )
	{
		tts_playing = 0;
		if( test_flag == TEST_BIT_ALL )
		{
			print_testresult_count = 9;
		}
		GPIO_SetBits( GPIOD, GPIO_Pin_9 );  /*关功放*/
		return RT_EOK;                      /*找到了*/
	}
	return RT_ERROR;
}

/*响应CREG或CGREG
   +CREG:0,1
   +CGREG:0,5

 */
rt_err_t pt_resp_CGREG( char *p, uint16_t len )
{
	uint32_t i, n, code;
	i = sscanf( p, "%*[^:]:%d,%d", &n, &code );
	if( i != 2 )
	{
		return RT_ERROR;
	}
	if( ( code != 1 ) && ( code != 5 ) )
	{
		return RT_ERROR;
	}
	return RT_EOK;
}

/*
   SIM卡的IMSI号码为4600 00783208249，
      460 00 18 23 20 86 42

   接口号数据字段的内容为IMSI号码的后12位
   其6个字节的内容为 0x00 0x07 0x83 0x20 0x82 0x49

 */
rt_err_t pt_resp_CIMI( char *p, uint16_t len )
{
	char *pimsi, i;

	rt_kprintf( "cimi len=%d\n", len );
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	strcpy( gsm_param.imsi, p );
	return RT_EOK;
}

/*响应CGSN**/
rt_err_t pt_resp_CGSN( char *p, uint16_t len )
{
	char	*pimsi, i;
	char	*pstr;
	if( len < 15 )
	{
		return RT_ERROR;
	}
	strip_numstring( p );
	strcpy( gsm_param.imsi, p );
	return RT_EOK;
}

/*响应CPIN*/
rt_err_t pt_resp_CPIN( char *p, uint16_t len )
{
	char *pstr = RT_NULL;
	pstr = strstr( p, "+CPIN: READY" ); //+CPIN: READY
	if( pstr )
	{
		return RT_EOK;                  /*找到了*/
	}
	return RT_ERROR;
}

/* +CSQ: 31, 99 */
/*M66 +CSQ: 13,99*/
/*    +CSQ: 15,99*/

rt_err_t pt_resp_CSQ( char *p, uint16_t len )
{
	char		*pstr;
	uint32_t	i, n = 0, ber = 0;

	pstr = strstr( p, "+CSQ" );
	if( pstr == (char*)0 )
	{
		return RT_ERROR;
	}
	i = sscanf( pstr, "%*[^ ] %d,%d", &n, &ber );
	if( i != 2 )
	{
		return RT_ERROR;
	}
	if( n != 0 )
	{
		gsm_csq = n;
	}
	return RT_EOK;
}

