GuoZhiyong/RTT_GPS_STUSB_TEST/bsp/stm32f40x_production/drivers/mc8332.c
/*+CGATT:1*/
rt_err_t pt_resp_CGATT( char *p, uint16_t len )
{
	char *pfind = RT_NULL;
	pfind = strstr( p, "+CGATT: 1" );
	if( pfind )
	{
		return RT_EOK;
	}
	return RT_ERROR;
}

/*%ETCPIP:1,"10.24.44.142","0.0.0.0","0.0.0.0"*/
rt_err_t pt_resp_ETCPIP( char *p, uint16_t len )
{
	rt_err_t	res		= RT_ERROR;
	uint8_t		stage	= 0;
	char		*psrc	= p;
	char		*pdst	= gsm_param.ip;

	while( 1 )
	{
		if( stage == 0 )
		{
			if( *psrc == '"' )
			{
				stage = 1;
			}
			psrc++;
		}else
		{
			if( *psrc == '"' )
			{
				break;
			}
			*pdst = *psrc;
			pdst++;
			psrc++;
		}
	}
	rt_kprintf( "ip=%s\r\n", gsm_param.ip );
	return RT_EOK;
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_err_t pt_resp_IPOPENX( char *p, uint16_t len )
{
	extern uint32_t gprs_ok_past_sec;

	if( strstr( p, "CONNECT" ) != RT_NULL )
	{
		gprs_ok_past_sec	= rt_tick_get( ) / 100;
		test_flag			|= TEST_BIT_GPRS;
		rt_kprintf( "\r\ntest_flag=%x", test_flag );
		return RT_EOK;
	}
	return RT_ERROR;
}

/*
   Platform Version:  MOCOR_09A_MP.W11.48_P1.08_Release
   Project Version: SC6600L_6610_modem
   MMI Version: V049P
   Base Version: BASE_10A.W11.48
   HW Version: SC6610_M10
   Build Time: 2-18-2013 17:15:32
   OK
 */
rt_err_t pt_resp_CGMR_M66( char *p, uint16_t len )
{
	extern char gsm_ver[8];
	char		*pdst = RT_NULL;

	pdst = strstr( p, "V0" );
	if( pdst != RT_NULL )
	{
		strncpy( gsm_ver, pdst + 2, 3 );
		return RT_EOK;
	}
	return RT_ERROR;
}
/*
+CGMR: S/W VER: MG815  BM8A413E ZTEiT Team  
OK
*/
rt_err_t pt_resp_CGMR( char *p, uint16_t len )
{
	extern char gsm_ver[8];
	char		*pdst = RT_NULL;

	pdst = strstr( p, "BM" );
	if( pdst != RT_NULL )
	{
		strncpy( gsm_ver, pdst + 5, 3 );
		return RT_EOK;
	}
	return RT_ERROR;
}




/*通用检查函数，看是否收到数据，如果有数据后再判断*/
rt_err_t pt_resp( RESP_FUNC func )
{
	char		*pstr;
	uint16_t	len;
	rt_err_t	ret;
	ret = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pstr, 0 );
	if( ret == -RT_ETIMEOUT )
	{
		return RT_ETIMEOUT;
	}
/*有应答，执行相应的函数*/
	len = ( ( *pstr ) << 8 ) | ( *( pstr + 1 ) );
	ret = func( pstr + 2, len );
	//rt_kprintf( "pt_resp ret=%x\r\n", ret );
	rt_free( pstr );
	return ret;
}

typedef rt_err_t ( *AT_RESP )( char *p, uint16_t len );
typedef struct
{
	char		*atcmd;
	AT_RESP		resp;
	uint16_t	timeout;
	uint16_t	retry;
}AT_CMD_RESP;

/*gsm供电的处理纤程*/

/**/
#ifdef M66

static int protothread_gsm_power( struct pt *pt )
{
	static AT_CMD_RESP at_init[] =
	{
		{ RT_NULL,											pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 10, 1	 },
		{ RT_NULL,											pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 10, 1	 },
		{ "ATE0\r\n",										pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 5,  1	 },
		{ "ATV1\r\n",										pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 5,  1	 },
		{ "AT%TTS=2,3,5,\"BFAACABCB2E2CAD4\"\r\n",			pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 20, 1	 },
		{ "AT+CPIN?\r\n",									pt_resp_CPIN,	 RT_TICK_PER_SECOND * 3,  10 },
		{ "AT+CREG?\r\n",									pt_resp_CGREG,	 RT_TICK_PER_SECOND * 3,  10 },
		{ "AT+CIMI\r\n",									pt_resp_CIMI,	 RT_TICK_PER_SECOND * 3,  1	 },
		{ "AT+CGMR\r\n",									pt_resp_CGMR,	 RT_TICK_PER_SECOND * 3,  10 },
		{ "AT+CGREG?\r\n",									pt_resp_CGREG,	 RT_TICK_PER_SECOND * 3,  10 },
		{ "AT+CGATT?\r\n",									pt_resp_CGATT,	 RT_TICK_PER_SECOND * 3,  10 },
		{ "AT+CGDCONT=1,\"IP\",\"CMNET\"\r\n",				pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 10, 1	 },
		{ "AT%ETCPIP=1,\"\",\"\"\r\n",						pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 30, 1	 },
		{ "AT%ETCPIP?\r\n",									pt_resp_ETCPIP,	 RT_TICK_PER_SECOND * 3,  1	 },
		{ "AT%IOMODE=1,2,1\r\n",							pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 3,  1	 },
		{ "AT%IPOPENX=1,\"TCP\",\"60.28.50.210\",9131\r\n", pt_resp_IPOPENX, RT_TICK_PER_SECOND * 3,  1	 },
	};

	static struct pt_timer	timer_gsm_power;
	static uint8_t			at_init_index	= 0;
	static uint8_t			at_init_retry	= 0;
	rt_err_t				ret;

	PT_BEGIN( pt );
	if( gsm_state == GSM_POWERON )
	{
		GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
		GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		pt_timer_set( &timer_gsm_power, 200 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) );
		GPIO_SetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		GPIO_SetBits( GSM_PWR_PORT, GSM_PWR_PIN );

		//GPIO_ResetBits(GPIOD,GPIO_Pin_9); /*开功放*/

		for( at_init_index = 0; at_init_index < sizeof( at_init ) / sizeof( AT_CMD_RESP ); at_init_index++ )
		{
			for( at_init_retry = 0; at_init_retry < at_init[at_init_index].retry; at_init_retry++ )
			{
				if( at_init[at_init_index].atcmd != RT_NULL )
				{
					dev_gsm_write( &dev_gsm, 0, at_init[at_init_index].atcmd, strlen( at_init[at_init_index].atcmd ) );
					rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), at_init[at_init_index].atcmd );
				}
				pt_timer_set( &timer_gsm_power, at_init[at_init_index].timeout );
				PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) || ( RT_EOK == pt_resp( at_init[at_init_index].resp ) ) );
				if( pt_timer_expired( &timer_gsm_power ) ) /*超时*/
				{
					rt_kprintf( "timeout\r\n" );
				}else
				{
					break;
				}
			}
			if( pt_timer_expired( &timer_gsm_power ) )  /*因为超时退出的*/
			{
				PT_EXIT( pt );
			}
		}
		//GPIO_SetBits(GPIOD,GPIO_Pin_9); /*关功放*/
		gsm_state = GSM_AT;                             /*切换到AT状态*/
	}
	if( gsm_state == GSM_AT )                           /*定时查CSQ*/
	{
		dev_gsm_write( &dev_gsm, 0, "AT+CSQ\r\n", 8 );
		rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), "AT+CSQ\r\n" );
		pt_timer_set( &timer_gsm_power, RT_TICK_PER_SECOND * 3 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) || ( RT_EOK == pt_resp( pt_resp_CSQ ) ) );
		if( pt_timer_expired( &timer_gsm_power ) )      /*超时*/
		{
			rt_kprintf( "\r\nAT+CSQ timeout\r\n" );
		}
		pt_timer_set( &timer_gsm_power, RT_TICK_PER_SECOND * 3 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) );
	}
	if( gsm_state == GSM_POWEROFF )
	{
		GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
		GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		gsm_state = GSM_IDLE;
	}
	PT_END( pt );
}

#endif

#ifdef MC8332


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static int protothread_gsm_power( struct pt *pt )
{
	static AT_CMD_RESP at_init[] =
	{
		{ RT_NULL,								 pt_resp_ZIND,		 RT_TICK_PER_SECOND * 10, 1	 },
		{ "ATE0\r\n",							 pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 5,  1	 },
		{ "ATV1\r\n",							 pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 5,  1	 },
		{ "AT+CPIN?\r\n",						 pt_resp_CPIN,		 RT_TICK_PER_SECOND * 3,  10 },
		{ "AT+CREG?\r\n",						 pt_resp_CGREG,		 RT_TICK_PER_SECOND * 3,  10 },
		{ "AT+SPEAKER=1\r\n",					 pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 5,  1	 },
		{ "AT+VGR=3\r\n",						 pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 5,  1	 },
		{ "AT%ZTTS=2,\"BFAACABCB2E2CAD4\"\r\n",	 pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 20, 1	 },

