GuoZhiyong/RTT_GPS_STUSB_TEST/bsp/stm32f40x_production/drivers/mc8332.c
		{ "AT+CIMI\r\n",						 pt_resp_CIMI,		 RT_TICK_PER_SECOND * 3,  1	 },
		{ "AT+CGMR\r\n",						 pt_resp_CGMR,		 RT_TICK_PER_SECOND * 3,  10 },

		{ "AT%ZPNUM=#777\r\n",					 pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 20, 1	 },
		{ "AT%ZPIDPWD=card,card\r\n",			 pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 20, 1	 },
		{ "AT%ZPPPOPEN\r\n",					 pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 20, 1	 },
		{ RT_NULL,								 pt_resp_ZPPPSTATUS, RT_TICK_PER_SECOND * 40, 1	 },
		{ "AT+ZIPSETUP=0,60.28.50.210,9131\r\n", pt_resp_STR_OK,	 RT_TICK_PER_SECOND * 10, 1	 },
	};

	static struct pt_timer	timer_gsm_power;
	static uint8_t			at_init_index	= 0;
	static uint8_t			at_init_retry	= 0;
	rt_err_t				ret;

	PT_BEGIN( pt );
	if( gsm_state == GSM_POWERON )
	{
		GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
		GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		pt_timer_set( &timer_gsm_power, 200 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) );
		GPIO_SetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		GPIO_SetBits( GSM_PWR_PORT, GSM_PWR_PIN );

		//GPIO_ResetBits(GPIOD,GPIO_Pin_9); /*开功放*/

		for( at_init_index = 0; at_init_index < sizeof( at_init ) / sizeof( AT_CMD_RESP ); at_init_index++ )
		{
			for( at_init_retry = 0; at_init_retry < at_init[at_init_index].retry; at_init_retry++ )
			{
				if( at_init[at_init_index].atcmd != RT_NULL )
				{
					dev_gsm_write( &dev_gsm, 0, at_init[at_init_index].atcmd, strlen( at_init[at_init_index].atcmd ) );
					rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), at_init[at_init_index].atcmd );
				}
				pt_timer_set( &timer_gsm_power, at_init[at_init_index].timeout );
				PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) || ( RT_EOK == pt_resp( at_init[at_init_index].resp ) ) );
				if( pt_timer_expired( &timer_gsm_power ) ) /*超时*/
				{
					rt_kprintf( "timeout\r\n" );
				}else
				{
					break;
				}
			}
			if( pt_timer_expired( &timer_gsm_power ) )  /*因为超时退出的*/
			{
				PT_EXIT( pt );
			}
		}
		//GPIO_SetBits(GPIOD,GPIO_Pin_9); /*关功放*/
		gsm_state = GSM_AT;                             /*切换到AT状态*/
	}
	if( gsm_state == GSM_AT )                           /*定时查CSQ*/
	{
		dev_gsm_write( &dev_gsm, 0, "AT+CSQ\r\n", 8 );
		rt_kprintf( "%08d gsm_send>%s", rt_tick_get( ), "AT+CSQ\r\n" );
		pt_timer_set( &timer_gsm_power, RT_TICK_PER_SECOND * 3 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) || ( RT_EOK == pt_resp( pt_resp_CSQ ) ) );
		if( pt_timer_expired( &timer_gsm_power ) )      /*超时*/
		{
			rt_kprintf( "\r\nAT+CSQ timeout\r\n" );
		}
		pt_timer_set( &timer_gsm_power, RT_TICK_PER_SECOND * 3 );
		PT_WAIT_UNTIL( pt, pt_timer_expired( &timer_gsm_power ) );
	}
	if( gsm_state == GSM_POWEROFF )
	{
		GPIO_ResetBits( GSM_PWR_PORT, GSM_PWR_PIN );
		GPIO_ResetBits( GSM_TERMON_PORT, GSM_TERMON_PIN );
		gsm_state = GSM_IDLE;
	}
	PT_END( pt );
}

#endif

ALIGN( RT_ALIGN_SIZE )
static char thread_gsm_stack[1024];
struct rt_thread thread_gsm;


/***********************************************************
* Function:       rt_thread_entry_gsm
* Description:    接收处理，状态转换
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
static void rt_thread_entry_gsm( void* parameter )
{
	rt_tick_t		curr_ticks;
	rt_err_t		res;
	unsigned char	ch;
	char			*ptts;

	PT_INIT( &pt_gsm_power );

	while( 1 )
	{
		while( rt_ringbuffer_getchar( &rb_uart4_rx, &ch ) == 1 ) /*有数据时，保存数据*/
		{
			gsm_rx[gsm_rx_wr++] = ch;
			if( gsm_rx_wr == GSM_RX_SIZE )
			{
				gsm_rx_wr = 0;
			}
			gsm_rx[gsm_rx_wr] = 0;
		}
		if( rt_tick_get( ) - last_tick > RT_TICK_PER_SECOND / 10 )  //等待100ms,实际上就是变长的延时,最迟100ms处理完一个数据包
		{
			if( gsm_rx_wr )
			{
				gsmrx_cb( gsm_rx, gsm_rx_wr );                      /*接收信息的处理函数*/
				gsm_rx_wr = 0;
			}
		}
		if( tts_playing == 0 )
		{
			res = rt_mb_recv( &mb_tts, (rt_uint32_t*)&ptts, 0 );
			if( res == RT_EOK )
			{
				GPIO_ResetBits( GPIOD, GPIO_Pin_9 ); /*开功放*/
				rt_kprintf( "\r\nTTS(%d)>%s", strlen( ptts ), ptts );
				dev_gsm_write( &dev_gsm, 0, ptts, strlen( ptts ) );
				tts_playing = 1;
				rt_free( ptts );
			}
		}
		protothread_gsm_power( &pt_gsm_power );

		rt_thread_delay( RT_TICK_PER_SECOND / 20 );
	}
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void gsm_init( void )
{
	rt_thread_t tid;

/*初始化串口接收缓冲区*/
	rt_ringbuffer_init( &rb_uart4_rx, uart4_rxbuf, UART4_RX_SIZE );

	rt_mb_init( &mb_gsmrx, "gsm_rx", &mb_gsmrx_pool, MB_GSMRX_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );

	rt_mb_init( &mb_tts, "tts", &mb_tts_pool, MB_TTS_POOL_SIZE / 4, RT_IPC_FLAG_FIFO );

	rt_thread_init( &thread_gsm,
	                "gsm",
	                rt_thread_entry_gsm,
	                RT_NULL,
	                &thread_gsm_stack[0],
	                sizeof( thread_gsm_stack ), 7, 5 );
	rt_thread_startup( &thread_gsm );

	dev_gsm.type	= RT_Device_Class_Char;
	dev_gsm.init	= dev_gsm_init;
	dev_gsm.open	= dev_gsm_open;
	dev_gsm.close	= dev_gsm_close;
	dev_gsm.read	= dev_gsm_read;
	dev_gsm.write	= dev_gsm_write;
	dev_gsm.control = dev_gsm_control;

	rt_device_register( &dev_gsm, "gsm", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_gsm );
}

/*控制gsm状态 0 查询*/
rt_err_t gsmstate( int cmd )
{
	if( cmd )
	{
		gsm_state = cmd;
	}
	return gsm_state;
}

FINSH_FUNCTION_EXPORT( gsmstate, control gsm state );


/*
   判断一个字符串是不是表示ip的str
   如果由[0..9|.] 组成

   '.' 0x2e
   '/' 0x2f
   '0' 0x30
   '9' 0x39
   简化一下。不判断 '/'
 */
static uint8_t is_ipstr( char * str )
{
	char *p = str;
	while( *p != NULL )
	{
		if( ( *p > '9' ) || ( *p < '.' ) )
		{
			return 0;
		}
		p++;
	}
	return 1;
}

/*调试信息控制输出*/
rt_err_t dbgmsg( uint32_t i )
{
	if( i == 0 )
	{
		rt_kprintf( "debmsg=%d\r\n", fgsm_rawdata_out );
	} else
	{
		fgsm_rawdata_out = i;
	}
	return RT_EOK;
}

FINSH_FUNCTION_EXPORT( dbgmsg, dbgmsg count );

/*发送AT命令*/
rt_size_t gsm_write( char *sinfo )
{
	return dev_gsm_write( &dev_gsm, 0, sinfo, strlen( sinfo ) );
}

FINSH_FUNCTION_EXPORT( gsm_write, write gsm );


/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
rt_size_t gsm_ipsend( uint8_t* buff, rt_size_t count, rt_int32_t timeout )
{
	rt_size_t	len = count;
	uint8_t		*p	= (uint8_t*)buff;
	uint8_t		c;
	char		*pstr;
	rt_err_t	ret;

	uint8_t		buf_start[20];
	uint8_t		buf_end[4] = { '"', 0x0d, 0x0a, 0x0 };

	uint8_t		tbl[16] = { '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'A', 'B', 'C', 'D', 'E', 'F' };

	sprintf( buf_start, "AT%%IPSENDX=1,\"" );
	dev_gsm_write( &dev_gsm, 0, buf_start, strlen( buf_start ) );
	rt_kprintf( "%s", buf_start );
	while( len )
	{
		c = *p++;

		USART_SendData( UART4, tbl[c >> 4] );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		rt_kprintf( "%c", tbl[c >> 4] );
		USART_SendData( UART4, tbl[c & 0x0f] );
		while( USART_GetFlagStatus( UART4, USART_FLAG_TC ) == RESET )
		{
		}
		rt_kprintf( "%c", tbl[c & 0x0f] );
		len--;
	}
	dev_gsm_write( &dev_gsm, 0, buf_end, 3 );
	rt_kprintf( "%s", buf_end );

	ret = rt_mb_recv( &mb_gsmrx, (rt_uint32_t*)&pstr, timeout );
	if( ret == -RT_ETIMEOUT )
	{
		return RT_ETIMEOUT;
	}
	len = ( ( *pstr ) << 8 ) | ( *( pstr + 1 ) );
	if( strstr( pstr + 2, "OK" ) )
	{
		ret = RT_EOK;
	} else
	{
		ret = RT_ERROR;
	}
	rt_free( pstr );

	return ret;
}

/************************************** The End Of File **************************************/
